# Kaggle Submissions

In [1]:
import pandas as pd

## First Attempt

In [2]:
pd.read_csv('../datasets/submission_1.csv')

       ID      SalePrice
0    2658   86485.853507
1    2718  158971.741527
2    2414  205869.528744
3    1989  166486.691102
4     625  156762.507747
..    ...            ...
873  1662  132635.855205
874  1234  207096.324051
875  1373  132330.805724
876  1672  132646.410550
877  1939  138572.660083

[878 rows x 2 columns]

#### Private Score
48398.88862
#### Public Score
56462.97728

## Second Attempt

In [3]:
pd.read_csv('../datasets/submission_2.csv')

       ID      SalePrice
0    2658  164911.025551
1    2718  176898.149819
2    2414  209308.412665
3    1989  160860.430574
4     625  176600.603614
..    ...            ...
873  1662  166367.931736
874  1234  181850.047755
875  1373  158748.873296
876  1672  160541.892087
877  1939  163471.267560

[878 rows x 2 columns]

#### Private Score
68114.10779
#### Public Score
76740.67144

## Third Attempt

In [4]:
pd.read_csv('../datasets/submission_3.csv')

       ID      SalePrice
0    2658  188964.757706
1    2718  173358.800239
2    2414  206034.518920
3    1989  149341.115004
4     625  163262.361780
..    ...            ...
873  1662  185876.502923
874  1234  217419.473648
875  1373  123260.979061
876  1672  103839.517411
877  1939  114489.408552

[878 rows x 2 columns]

#### Private Score
34559.29325
#### Public Score
38482.78306

## Fouth / Final Attempt

In [5]:
pd.read_csv('../datasets/submission_4.csv')

       ID      SalePrice
0    2658  168654.306375
1    2718  207155.563463
2    2414  191464.430666
3    1989  130293.116401
4     625  175286.877346
..    ...            ...
873  1662  190073.556533
874  1234  216653.838778
875  1373  133581.369013
876  1672  112113.730069
877  1939  110479.506961

[878 rows x 2 columns]

#### Private Score
30654.41422
#### Public Score
35326.83592

# Overall Ranking - 15
With 18 people on the leader board. 
Oddly, the scores are almost backward compared to my modeling scores with my first score being the best in Kaggle and the worst in my modeling and testing.